#### Dev Environment Plan 📖
<details><summary>Show Plan</summary>
```terraform
module.backend.data.archive_file.lambda_zip: Reading...
module.backend.data.archive_file.lambda_zip: Read complete after 0s [id=589069bd3082e8dbc0cda96a8878dda2c8edf35c]
module.backend.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::195481994910:policy/vstshop-lambda-policy-dev]
module.backend.aws_iam_role_policy_attachment.lambda_s3: Refreshing state... [id=vstshop-lambda-role-dev/arn:aws:iam::195481994910:policy/vstshop-s3-access-dev]
module.backend.aws_iam_policy.s3_access: Refreshing state... [id=arn:aws:iam::195481994910:policy/vstshop-s3-access-dev]
module.backend.aws_iam_role.lambda_role: Refreshing state... [id=vstshop-lambda-role-dev]
module.storage.aws_s3_bucket.vst_storage: Refreshing state... [id=vst-storage-dev-195481994910]
module.backend.aws_api_gateway_rest_api.api: Refreshing state... [id=g6jnm33pu7]
module.auth.aws_cognito_user_pool.pool: Refreshing state... [id=us-east-2_V9hhjw2Y5]
module.frontend.aws_s3_bucket.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.backend.aws_dynamodb_table.users: Refreshing state... [id=vstshop-users-dev]
module.frontend.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E1D4T2JQQTCZIX]
module.backend.aws_api_gateway_resource.check_vst: Refreshing state... [id=khqpyv]
module.backend.module.api_cors.aws_api_gateway_method._: Refreshing state... [id=agm-g6jnm33pu7-khqpyv-OPTIONS]
module.backend.module.api_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-g6jnm33pu7-khqpyv-OPTIONS-200]
module.backend.module.api_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-g6jnm33pu7-khqpyv-OPTIONS]
module.backend.module.api_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-g6jnm33pu7-khqpyv-OPTIONS-200]
module.auth.aws_cognito_user_pool_domain.main: Refreshing state... [id=vstshop-dev-vst-dev-123]
module.backend.aws_api_gateway_authorizer.cognito: Refreshing state... [id=7wqxx7]
module.backend.aws_api_gateway_method.check_vst_get: Refreshing state... [id=agm-g6jnm33pu7-khqpyv-GET]
module.frontend.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E228GMNSTNHTAD]
module.storage.aws_s3_bucket_public_access_block.vst_storage_block: Refreshing state... [id=vst-storage-dev-195481994910]
module.backend.aws_iam_role_policy_attachment.lambda_attach: Refreshing state... [id=vstshop-lambda-role-dev/arn:aws:iam::195481994910:policy/vstshop-lambda-policy-dev]
module.backend.aws_lambda_function.vst_checker: Refreshing state... [id=vstshop-vst-checker-dev]
module.frontend.aws_s3_bucket_policy.frontend_policy: Refreshing state... [id=vstshop-frontend-dev123]
module.storage.aws_s3_bucket_cors_configuration.vst_cors: Refreshing state... [id=vst-storage-dev-195481994910]
module.auth.aws_cognito_user_pool_client.client: Refreshing state... [id=2p1utd8g6jkts9qp59n7b5k9le]
local_file.env_file: Refreshing state... [id=a78a126b90b2621787fe6bf2532a558ed814f5ca]
module.backend.aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-g6jnm33pu7-khqpyv-GET]
module.backend.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.backend.aws_api_gateway_deployment.deployment: Refreshing state... [id=7ia3cs]
module.backend.aws_api_gateway_stage.this: Refreshing state... [id=ags-g6jnm33pu7-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.backend.aws_dynamodb_table.users will be destroyed
  # (because aws_dynamodb_table.users is not in configuration)
  - resource "aws_dynamodb_table" "users" {
      - arn                         = "arn:aws:dynamodb:us-east-2:195481994910:table/vstshop-users-dev" -> null
      - billing_mode                = "PAY_PER_REQUEST" -> null
      - deletion_protection_enabled = false -> null
      - hash_key                    = "userId" -> null
      - id                          = "vstshop-users-dev" -> null
      - name                        = "vstshop-users-dev" -> null
      - read_capacity               = 0 -> null
      - region                      = "us-east-2" -> null
      - stream_enabled              = false -> null
      - table_class                 = "STANDARD" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - write_capacity              = 0 -> null
        # (3 unchanged attributes hidden)

      - attribute {
          - name = "userId" -> null
          - type = "S" -> null
        }

      - point_in_time_recovery {
          - enabled                 = false -> null
          - recovery_period_in_days = 0 -> null
        }

      - ttl {
          - enabled        = false -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.backend.aws_iam_policy.lambda_combined_policy will be created
  + resource "aws_iam_policy" "lambda_combined_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Permissions for CloudWatch, DynamoDB (Purchases), and S3 Presigning"
      + id               = (known after apply)
      + name             = "vstshop-lambda-combined-policy-dev"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.backend.aws_iam_policy.lambda_policy will be destroyed
  # (because aws_iam_policy.lambda_policy is not in configuration)
  - resource "aws_iam_policy" "lambda_policy" {
      - arn              = "arn:aws:iam::195481994910:policy/vstshop-lambda-policy-dev" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::195481994910:policy/vstshop-lambda-policy-dev" -> null
      - name             = "vstshop-lambda-policy-dev" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:GetItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:Query",
                          - "dynamodb:UpdateItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-2:195481994910:table/vstshop-users-dev",
                          - "arn:aws:dynamodb:us-east-2:195481994910:table/vstshop-users-dev/index/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAS3A5CQ2PL5TLWCGXM" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.backend.aws_iam_policy.s3_access will be destroyed
  # (because aws_iam_policy.s3_access is not in configuration)
  - resource "aws_iam_policy" "s3_access" {
      - arn              = "arn:aws:iam::195481994910:policy/vstshop-s3-access-dev" -> null
      - attachment_count = 1 -> null
      - description      = "Allows Lambda to sign S3 URLs" -> null
      - id               = "arn:aws:iam::195481994910:policy/vstshop-s3-access-dev" -> null
      - name             = "vstshop-s3-access-dev" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::vst-storage-dev-195481994910/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAS3A5CQ2POWBWBUTIK" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (1 unchanged attribute hidden)
    }

  # module.backend.aws_iam_role_policy_attachment.lambda_attach must be replaced
-/+ resource "aws_iam_role_policy_attachment" "lambda_attach" {
      ~ id         = "vstshop-lambda-role-dev/arn:aws:iam::195481994910:policy/vstshop-lambda-policy-dev" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::195481994910:policy/vstshop-lambda-policy-dev" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.backend.aws_iam_role_policy_attachment.lambda_s3 will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_s3 is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_s3" {
      - id         = "vstshop-lambda-role-dev/arn:aws:iam::195481994910:policy/vstshop-s3-access-dev" -> null
      - policy_arn = "arn:aws:iam::195481994910:policy/vstshop-s3-access-dev" -> null
      - role       = "vstshop-lambda-role-dev" -> null
    }

  # module.backend.aws_lambda_function.vst_checker will be updated in-place
  ~ resource "aws_lambda_function" "vst_checker" {
        id                             = "vstshop-vst-checker-dev"
      ~ last_modified                  = "2026-02-16T20:53:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "k5MznqlWAscn2gQhE5E/fyw8WHP5BA45k6M/UZwlUq8=" -> "ggL6+ehhPGRu1MVUqd9O12zV9OPqC6Pq/tBUYCPUR2g="
        tags                           = {}
        # (30 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "TABLE_NAME"      = "vstshop-users-dev" -> "vstshop-purchases-dev"
                # (1 unchanged element hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.database.aws_dynamodb_table.purchases will be created
  + resource "aws_dynamodb_table" "purchases" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "userId"
      + id               = (known after apply)
      + name             = "vstshop-purchases-dev"
      + range_key        = "productId"
      + read_capacity    = (known after apply)
      + region           = "us-east-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "vstshop-purchases"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "vstshop-purchases"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "productId"
          + type = "S"
        }
      + attribute {
          + name = "userId"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

Plan: 3 to add, 1 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>